Rahix/avr-device/vendor/attiny1634.atdf
<?xml version='1.0' encoding='UTF-8'?>
<avr-tools-device-file xmlns:xalan="http://xml.apache.org/xalan" xmlns:NumHelper="NumHelper" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.3" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant tempmin="-40" tempmax="85" speedmax="12000000" package="QFN20" ordercode="ATtiny1634-MU" vccmin="1.8" vccmax="5.5"/>
    <variant tempmin="-40" tempmax="85" speedmax="12000000" package="QFN20" ordercode="ATtiny1634-MUR" vccmin="1.8" vccmax="5.5"/>
    <variant tempmin="-40" tempmax="85" speedmax="12000000" package="QFN20" ordercode="ATtiny1634R-MU" vccmin="1.8" vccmax="5.5"/>
    <variant tempmin="-40" tempmax="85" speedmax="12000000" package="QFN20" ordercode="ATtiny1634R-MUR" vccmin="1.8" vccmax="5.5"/>
    <variant tempmin="-40" tempmax="105" speedmax="12000000" package="QFN20" ordercode="ATtiny1634-MN" vccmin="1.8" vccmax="5.5"/>
    <variant tempmin="-40" tempmax="105" speedmax="12000000" package="QFN20" ordercode="ATtiny1634-MNR" vccmin="1.8" vccmax="5.5"/>
    <variant tempmin="-40" tempmax="85" speedmax="12000000" package="SOIC20" ordercode="ATtiny1634-SU" vccmin="1.8" vccmax="5.5"/>
    <variant tempmin="-40" tempmax="85" speedmax="12000000" package="SOIC20" ordercode="ATtiny1634-SUR" vccmin="1.8" vccmax="5.5"/>
    <variant tempmin="-40" tempmax="85" speedmax="12000000" package="SOIC20" ordercode="ATtiny1634R-SU" vccmin="1.8" vccmax="5.5"/>
    <variant tempmin="-40" tempmax="85" speedmax="12000000" package="SOIC20" ordercode="ATtiny1634R-SUR" vccmin="1.8" vccmax="5.5"/>
  </variants>
  <devices>
    <device name="ATtiny1634" architecture="AVR8" family="tinyAVR">
      <address-spaces>
        <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x4000">
          <memory-segment start="0x0000" size="0x4000" type="flash" rw="RW" exec="1" name="FLASH" pagesize="0x20"/>
        </address-space>
        <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
          <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
        </address-space>
        <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0003">
          <memory-segment start="0" size="0x0003" type="fuses" rw="RW" exec="0" name="FUSES"/>
        </address-space>
        <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
          <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
        </address-space>
        <address-space endianness="little" name="data" id="data" start="0x0000" size="0x0500">
          <memory-segment external="false" type="regs" size="0x0020" start="0x0000" name="REGISTERS"/>
          <memory-segment name="MAPPED_IO" start="0x0020" size="0x00e0" type="io" external="false"/>
          <memory-segment name="IRAM" start="0x0100" size="0x0400" type="ram" external="false"/>
        </address-space>
        <address-space endianness="little" name="eeprom" id="eeprom" start="0x0000" size="0x0100">
          <memory-segment start="0x0000" size="0x0100" type="eeprom" rw="RW" exec="0" name="EEPROM" pagesize="0x04"/>
        </address-space>
        <address-space size="0x40" start="0x00" endianness="little" name="io" id="io"/>
      </address-spaces>
      <peripherals>
        <module name="TWI">
          <instance name="TWI" caption="Two Wire Serial Interface">
            <register-group name="TWI" name-in-module="TWI" offset="0x00" address-space="data" caption="Two Wire Serial Interface"/>
          </instance>
        </module>
        <module name="PORT">
          <instance name="PORTB" caption="I/O Port">
            <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data" caption="I/O Port"/>
          </instance>
          <instance name="PORTC" caption="I/O Port">
            <register-group name="PORTC" name-in-module="PORTC" offset="0x00" address-space="data" caption="I/O Port"/>
          </instance>
          <instance name="PORTA" caption="I/O Port">
            <register-group name="PORTA" name-in-module="PORTA" offset="0x00" address-space="data" caption="I/O Port"/>
          </instance>
        </module>
        <module name="ADC">
          <instance name="ADC" caption="Analog-to-Digital Converter">
            <register-group name="ADC" name-in-module="ADC" offset="0x00" address-space="data" caption="Analog-to-Digital Converter"/>
          </instance>
        </module>
        <module name="AC">
          <instance name="AC" caption="Analog Comparator">
            <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data" caption="Analog Comparator"/>
          </instance>
        </module>
        <module name="EEPROM">
          <instance name="EEPROM" caption="EEPROM">
            <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data" caption="EEPROM"/>
          </instance>
        </module>
        <module name="TC16">
          <instance name="TC1" caption="Timer/Counter, 16-bit">
            <register-group name="TC1" name-in-module="TC1" offset="0x00" address-space="data" caption="Timer/Counter, 16-bit"/>
          </instance>
        </module>
        <module name="TC8">
          <instance name="TC0" caption="Timer/Counter, 8-bit">
            <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data" caption="Timer/Counter, 8-bit"/>
          </instance>
        </module>
        <module name="EXINT">
          <instance name="EXINT" caption="External Interrupts">
            <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data" caption="External Interrupts"/>
          </instance>
        </module>
        <module name="CPU">
          <instance name="CPU" caption="CPU Registers">
            <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data" caption="CPU Registers"/>
          <parameters>
        <param name="CORE_VERSION" value="V2"/>
        <param name="NEW_INSTRUCTIONS" value="lpm rd,z+"/>
      </parameters></instance>
        </module>
