Rahix/avr-device/vendor/attiny1634.atdf
      <value-group name="ENUM_BODMODE">
        <value caption="Sampled" name="BOD_SAMPLED" value="0x01"/>
        <value caption="Enabled" name="BOD_ENABLED" value="0x02"/>
        <value caption="Disabled" name="BOD_DISABLED" value="0x03"/>
      </value-group>
    </module>
    <module caption="Lockbits" name="LOCKBIT">
      <register-group caption="Lockbits" name="LOCKBIT">
        <register name="LOCKBIT" offset="0x00" size="1" initval="0xFF">
          <bitfield caption="Memory Lock" mask="0x03" name="LB" values="ENUM_LB"/>
        </register>
      </register-group>
      <value-group name="ENUM_LB">
        <value caption="Further programming and verification disabled" name="PROG_VER_DISABLED" value="0x00"/>
        <value caption="Further programming disabled" name="PROG_DISABLED" value="0x02"/>
        <value caption="No memory lock features enabled" name="NO_LOCK" value="0x03"/>
      </value-group>
    </module>
    <module caption="Two Wire Serial Interface" name="TWI">
      <register-group caption="Two Wire Serial Interface" name="TWI">
        <register caption="TWI Slave Control Register A" name="TWSCRA" offset="0x7F" size="1">
          <bitfield caption="TWI SDA Hold Time Enable" mask="0x80" name="TWSHE"/>
          <bitfield caption="TWI Data Interrupt Enable" mask="0x20" name="TWDIE"/>
          <bitfield caption="TWI Address/Stop Interrupt Enable" mask="0x10" name="TWASIE"/>
          <bitfield caption="Two-Wire Interface Enable" mask="0x08" name="TWEN"/>
          <bitfield caption="TWI Stop Interrupt Enable" mask="0x04" name="TWSIE"/>
          <bitfield caption="TWI Promiscuous Mode Enable" mask="0x02" name="TWPME"/>
          <bitfield caption="TWI Smart Mode Enable" mask="0x01" name="TWSME"/>
        </register>
        <register caption="TWI Slave Control Register B" name="TWSCRB" offset="0x7E" size="1">
          <bitfield caption="TWI Acknowledge Action" mask="0x04" name="TWAA"/>
          <bitfield mask="0x03" name="TWCMD"/>
        </register>
        <register caption="TWI Slave Status Register A" name="TWSSRA" offset="0x7D" size="1">
          <bitfield caption="TWI Data Interrupt Flag" mask="0x80" name="TWDIF"/>
          <bitfield caption="TWI Address/Stop Interrupt Flag" mask="0x40" name="TWASIF"/>
          <bitfield caption="TWI Clock Hold" mask="0x20" name="TWCH"/>
          <bitfield caption="TWI Receive Acknowledge" mask="0x10" name="TWRA"/>
          <bitfield caption="TWI Collision" mask="0x08" name="TWC"/>
          <bitfield caption="TWI Bus Error" mask="0x04" name="TWBE"/>
          <bitfield caption="TWI Read/Write Direction" mask="0x02" name="TWDIR"/>
          <bitfield caption="TWI Address or Stop" mask="0x01" name="TWAS"/>
        </register>
        <register caption="TWI Slave Address Register" name="TWSA" offset="0x7C" size="1" ocd-rw="R">
          <bitfield caption="TWI slave address bit" mask="0xFF" name="TWSA"/>
        </register>
        <register caption="TWI Slave Data Register" name="TWSD" offset="0x7A" size="1" ocd-rw="R">
          <bitfield caption="TWI slave data bit" mask="0xFF" name="TWSD"/>
        </register>
        <register caption="TWI Slave Address Mask Register" name="TWSAM" offset="0x7B" size="1" mask="0xFF"/>
      </register-group>
    </module>
    <module caption="I/O Port" name="PORT">
      <register-group caption="I/O Port" name="PORTB">
        <register caption="Port Control Register" name="PORTCR" offset="0x33" size="1">
          <bitfield caption="Break-Before-Make Mode Enable" mask="0x02" name="BBMB"/>
        </register>
        <register caption="Pull-up Enable Control Register" name="PUEB" offset="0x2E" size="1">
          <bitfield caption="Pull-up Enable Control bit" name="PUEB" mask="0x0F"/>
        </register>
        <register caption="Data Direction Register, Port B" name="DDRB" offset="0x2C" size="1" mask="0x0F"/>
        <register caption="Port B Data register" name="PINB" offset="0x2B" size="1" mask="0x0F"/>
        <register caption="Input Pins, Port B" name="PORTB" offset="0x2D" size="1" mask="0x0F"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTC">
        <register caption="Port Control Register" name="PORTCR" offset="0x33" size="1">
          <bitfield caption="Break-Before-Make Mode Enable" mask="0x04" name="BBMC"/>
        </register>
        <register caption="Pull-up Enable Control Register" name="PUEC" offset="0x2A" size="1">
          <bitfield caption="Pull-up Enable Control bit" name="PUEC" mask="0x3F"/>
        </register>
        <register caption="Port C Data Register" name="PORTC" offset="0x29" size="1" mask="0x3F"/>
        <register caption="Data Direction Register, Port C" name="DDRC" offset="0x28" size="1" mask="0x3F"/>
        <register caption="Port C Input Pins" name="PINC" offset="0x27" size="1" mask="0x3F"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTA">
        <register caption="Port Control Register" name="PORTCR" offset="0x33" size="1">
          <bitfield caption="Break-Before-Make Mode Enable" mask="0x01" name="BBMA"/>
        </register>
        <register caption="Pull-up Enable Control Register" name="PUEA" offset="0x32" size="1">
          <bitfield caption="Pull-up Enable Control bit" name="PUEA" mask="0xFF"/>
        </register>
        <register caption="Port A Data Register" name="PORTA" offset="0x31" size="1" mask="0xFF"/>
        <register caption="Data Direction Register, Port A" name="DDRA" offset="0x30" size="1" mask="0xFF"/>
        <register caption="Port A Input Pins" name="PINA" offset="0x2F" size="1" mask="0xFF"/>
      </register-group>
    </module>
    <module caption="Analog-to-Digital Converter" name="ADC">
      <register-group caption="Analog-to-Digital Converter" name="ADC">
        <register caption="The ADC multiplexer Selection Register" name="ADMUX" offset="0x24" size="1">
          <bitfield caption="Reference Selection Bit" mask="0xC0" name="REFS"/>
          <bitfield mask="0x20" name="REFEN"/>
          <bitfield mask="0x10" name="ADC0EN"/>
          <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x0F" name="MUX"/>
        </register>
        <register caption="The ADC Control and Status register" name="ADCSRA" offset="0x23" size="1" ocd-rw="R">
          <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
          <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
          <bitfield caption="ADC Auto Trigger Enable" mask="0x20" name="ADATE"/>
          <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
          <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
          <bitfield caption="ADC Prescaler Select Bits" mask="0x07" name="ADPS" values="ANALOG_ADC_PRESCALER"/>
        </register>
        <register caption="ADC Data Register  Bytes" name="ADC" offset="0x20" size="2" mask="0xFFFF"/>
