Rahix/avr-device/vendor/attiny1634.atdf
        <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x22" size="1">
          <bitfield mask="0x80" name="VDEN"/>
          <bitfield mask="0x40" name="VDPD"/>
          <bitfield mask="0x08" name="ADLAR"/>
          <bitfield caption="ADC Auto Trigger Sources" mask="0x07" name="ADTS" values="ANALOG_ADC_AUTO_TRIGGER"/>
        </register>
        <register caption="Digital Input Disable Register 2" name="DIDR2" offset="0x62" size="1">
          <bitfield caption="ADC11 Digital input Disable" mask="0x04" name="ADC11D"/>
          <bitfield caption="ADC10 Digital input Disable" mask="0x02" name="ADC10D"/>
          <bitfield caption="ADC9 Digital input Disable" mask="0x01" name="ADC9D"/>
        </register>
        <register caption="Digital Input Disable Register 1" name="DIDR1" offset="0x61" size="1">
          <bitfield caption="ADC8 Digital Input Disable" mask="0x08" name="ADC8D"/>
          <bitfield caption="ADC7 Digital input Disable" mask="0x04" name="ADC7D"/>
          <bitfield caption="ADC6 Digital input Disable" mask="0x02" name="ADC6D"/>
          <bitfield caption="ADC5 Digital input Disable" mask="0x01" name="ADC5D"/>
        </register>
        <register caption="Digital Input Disable Register 0" name="DIDR0" offset="0x60" size="1">
          <bitfield caption="ADC4 Digital input Disable" mask="0x80" name="ADC4D"/>
          <bitfield caption="ADC3 Digital input Disable" mask="0x40" name="ADC3D"/>
          <bitfield caption="ADC2 Digital input Disable" mask="0x20" name="ADC2D"/>
          <bitfield caption="ADC1 Digital input Disable" mask="0x10" name="ADC1D"/>
          <bitfield caption="ADC0 Digital Input Disable" mask="0x08" name="ADC0D"/>
          <bitfield caption="AIN1 Digital input Disable" mask="0x04" name="AIN1D"/>
          <bitfield caption="AIN0 Digital input Disable" mask="0x02" name="AIN0D"/>
          <bitfield caption="AREF Digital input Disable" mask="0x01" name="AREFD"/>
        </register>
      </register-group>
      <value-group name="ANALOG_ADC_PRESCALER">
        <value caption="2" name="2" value="0x00"/>
        <value caption="2" name="2" value="0x01"/>
        <value caption="4" name="4" value="0x02"/>
        <value caption="8" name="8" value="0x03"/>
        <value caption="16" name="16" value="0x04"/>
        <value caption="32" name="32" value="0x05"/>
        <value caption="64" name="64" value="0x06"/>
        <value caption="128" name="128" value="0x07"/>
      </value-group>
      <value-group name="ANALOG_ADC_AUTO_TRIGGER">
        <value caption="Free Running mode" name="FREE_RUNNING_MODE" value="0x00"/>
        <value caption="Analog Comparator" name="ANALOG_COMPARATOR" value="0x01"/>
        <value caption="External Interrupt Request 0" name="EXTERNAL_INTERRUPT_REQUEST_0" value="0x02"/>
        <value caption="Timer/Counter0 Compare Match A" name="TIMER_COUNTER0_COMPARE_MATCH_A" value="0x03"/>
        <value caption="Timer/Counter0 Overflow" name="TIMER_COUNTER0_OVERFLOW" value="0x04"/>
        <value caption="Timer/Counter1 Compare Match B" name="TIMER_COUNTER1_COMPARE_MATCH_B" value="0x05"/>
        <value caption="Timer/Counter1 Overflow" name="TIMER_COUNTER1_OVERFLOW" value="0x06"/>
        <value caption="Timer/Counter1 Capture Event" name="TIMER_COUNTER1_CAPTURE_EVENT" value="0x07"/>
      </value-group>
    </module>
    <module caption="Analog Comparator" name="AC">
      <register-group caption="Analog Comparator" name="AC">
        <register caption="Analog Comparator Control And Status Register B" name="ACSRB" offset="0x25" size="1">
          <bitfield caption="Hysteresis Select" mask="0x80" name="HSEL"/>
          <bitfield caption="Hysteresis Level" mask="0x40" name="HLEV"/>
          <bitfield mask="0x20" name="ACLP"/>
          <bitfield mask="0x08" name="ACCE"/>
          <bitfield caption="Analog Comparator Multiplexer Enable" mask="0x04" name="ACME"/>
          <bitfield mask="0x03" name="ACIRS"/>
        </register>
        <register caption="Analog Comparator Control And Status Register A" name="ACSRA" offset="0x26" size="1">
          <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
          <bitfield caption="Analog Comparator Bandgap Select" mask="0x40" name="ACBG"/>
          <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
          <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
          <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
          <bitfield caption="Analog Comparator Input Capture Enable" mask="0x04" name="ACIC"/>
          <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS" values="ANALOG_COMP_INTERRUPT"/>
        </register>
      </register-group>
      <value-group name="ANALOG_COMP_INTERRUPT">
        <value caption="Interrupt on Toggle" name="INTERRUPT_ON_TOGGLE" value="0x00"/>
        <value caption="Reserved" name="RESERVED" value="0x01"/>
        <value caption="Interrupt on Falling Edge" name="INTERRUPT_ON_FALLING_EDGE" value="0x02"/>
        <value caption="Interrupt on Rising Edge" name="INTERRUPT_ON_RISING_EDGE" value="0x03"/>
      </value-group>
    </module>
    <module caption="EEPROM" name="EEPROM">
      <register-group caption="EEPROM" name="EEPROM">
        <register caption="EEPROM Read/Write Access" name="EEAR" offset="0x3E" size="2" mask="0x01FF"/>
        <register caption="EEPROM Data Register" name="EEDR" offset="0x3D" size="1" mask="0xFF"/>
        <register caption="EEPROM Control Register" name="EECR" offset="0x3C" size="1">
          <bitfield caption="EEPROM Programming Mode Bits" mask="0x30" name="EEPM" values="EEP_MODE"/>
          <bitfield caption="EEProm Ready Interrupt Enable" mask="0x08" name="EERIE"/>
          <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMPE"/>
          <bitfield caption="EEPROM Write Enable" mask="0x02" name="EEPE"/>
          <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
        </register>
      </register-group>
      <value-group name="EEP_MODE">
        <value caption="Erase and Write in one operation" name="ERASE_AND_WRITE_IN_ONE_OPERATION" value="0x00"/>
        <value caption="Erase Only" name="ERASE_ONLY" value="0x01"/>
        <value caption="Write Only" name="WRITE_ONLY" value="0x02"/>
      </value-group>
    </module>
    <module caption="Timer/Counter, 16-bit" name="TC16">
      <register-group caption="Timer/Counter, 16-bit" name="TC1">
        <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK" offset="0x5A" size="1">
          <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x80" name="TOIE1"/>
          <bitfield caption="Timer/Counter1 Output CompareA Match Interrupt Enable" mask="0x40" name="OCIE1A"/>
          <bitfield caption="Timer/Counter1 Output CompareB Match Interrupt Enable" mask="0x20" name="OCIE1B"/>
          <bitfield caption="Timer/Counter1 Input Capture Interrupt Enable" mask="0x08" name="ICIE1"/>
        </register>
