Rahix/avr-device/vendor/attiny1634.atdf
        <register caption="Timer/Counter Interrupt Flag register" name="TIFR" offset="0x59" size="1" ocd-rw="R">
          <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x80" name="TOV1"/>
          <bitfield caption="Output Compare Flag 1A" mask="0x40" name="OCF1A"/>
          <bitfield caption="Output Compare Flag 1B" mask="0x20" name="OCF1B"/>
          <bitfield caption="Input Capture Flag 1" mask="0x08" name="ICF1"/>
        </register>
        <register caption="Timer/Counter1 Control Register A" name="TCCR1A" offset="0x72" size="1">
          <bitfield caption="Compare Output Mode 1A, bits" mask="0xC0" name="COM1A"/>
          <bitfield caption="Compare Output Mode 1B, bits" mask="0x30" name="COM1B"/>
          <bitfield caption="Pulse Width Modulator Select Bits" mask="0x03" name="WGM1"/>
        </register>
        <register caption="Timer/Counter1 Control Register B" name="TCCR1B" offset="0x71" size="1">
          <bitfield caption="Input Capture 1 Noise Canceler" mask="0x80" name="ICNC1"/>
          <bitfield caption="Input Capture 1 Edge Select" mask="0x40" name="ICES1"/>
          <bitfield caption="Waveform Generation Mode Bits" mask="0x18" name="WGM1" lsb="2"/>
          <bitfield caption="Clock Select1 bits" mask="0x07" name="CS1" values="CLK_SEL_3BIT_EXT"/>
        </register>
        <register caption="Timer/Counter1 Control Register C" name="TCCR1C" offset="0x70" size="1" ocd-rw="R">
          <bitfield caption="Force Output Compare for Channel A" mask="0x80" name="FOC1A"/>
          <bitfield caption="Force Output Compare for Channel B" mask="0x40" name="FOC1B"/>
        </register>
        <register caption="Timer/Counter1  Bytes" name="TCNT1" offset="0x6E" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Output Compare Register  Bytes" name="OCR1A" offset="0x6C" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Output Compare Register  Bytes" name="OCR1B" offset="0x6A" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Input Capture Register  Bytes" name="ICR1" offset="0x68" size="2" mask="0xFFFF"/>
        <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x67" size="1">
          <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
          <bitfield caption="Prescaler Reset Timer/Counter1 and Timer/Counter0" mask="0x01" name="PSR10"/>
        </register>
      </register-group>
      <value-group name="CLK_SEL_3BIT_EXT">
        <value caption="No Clock Source (Stopped)" name="NO_CLOCK_SOURCE_STOPPED" value="0x00"/>
        <value caption="Running, No Prescaling" name="RUNNING_NO_PRESCALING" value="0x01"/>
        <value caption="Running, CLK/8" name="RUNNING_CLK_8" value="0x02"/>
        <value caption="Running, CLK/64" name="RUNNING_CLK_64" value="0x03"/>
        <value caption="Running, CLK/256" name="RUNNING_CLK_256" value="0x04"/>
        <value caption="Running, CLK/1024" name="RUNNING_CLK_1024" value="0x05"/>
        <value caption="Running, ExtClk Tn Falling Edge" name="RUNNING_EXTCLK_TN_FALLING_EDGE" value="0x06"/>
        <value caption="Running, ExtClk Tn Rising Edge" name="RUNNING_EXTCLK_TN_RISING_EDGE" value="0x07"/>
      </value-group>
    </module>
    <module caption="Timer/Counter, 8-bit" name="TC8">
      <register-group caption="Timer/Counter, 8-bit" name="TC0">
        <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK" offset="0x5A" size="1">
          <bitfield caption="Timer/Counter0 Output Compare Match B Interrupt Enable" mask="0x04" name="OCIE0B"/>
          <bitfield caption="Timer/Counter0 Overflow Interrupt Enable" mask="0x02" name="TOIE0"/>
          <bitfield caption="Timer/Counter0 Output Compare Match A Interrupt Enable" mask="0x01" name="OCIE0A"/>
        </register>
        <register caption="Timer/Counter Interrupt Flag register" name="TIFR" offset="0x59" size="1" ocd-rw="R">
          <bitfield caption="Timer/Counter0 Output Compare Flag 0B" mask="0x04" name="OCF0B"/>
          <bitfield caption="Timer/Counter0 Overflow Flag" mask="0x02" name="TOV0"/>
          <bitfield caption="Timer/Counter0 Output Compare Flag 0A" mask="0x01" name="OCF0A"/>
        </register>
        <register caption="Timer/Counter0 Output Compare Register" name="OCR0B" offset="0x37" size="1" mask="0xFF"/>
        <register caption="Timer/Counter0 Output Compare Register" name="OCR0A" offset="0x38" size="1" mask="0xFF"/>
        <register caption="Timer/Counter  Control Register A" name="TCCR0A" offset="0x3B" size="1">
          <bitfield caption="Compare Match Output A Mode" mask="0xC0" name="COM0A"/>
          <bitfield caption="Compare Match Output B Mode" mask="0x30" name="COM0B"/>
          <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM0"/>
        </register>
        <register caption="Timer/Counter0" name="TCNT0" offset="0x39" size="1" mask="0xFF"/>
        <register caption="Timer/Counter Control Register B" name="TCCR0B" offset="0x3A" size="1">
          <bitfield caption="Force Output Compare B" mask="0x80" name="FOC0A"/>
          <bitfield caption="Force Output Compare B" mask="0x40" name="FOC0B"/>
          <bitfield mask="0x08" name="WGM02"/>
          <bitfield caption="Clock Select" mask="0x07" name="CS0" values="CLK_SEL_3BIT_EXT"/>
        </register>
        <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x67" size="1">
          <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
          <bitfield caption="Prescaler Reset Timer/Counter1 and Timer/Counter0" mask="0x01" name="PSR10"/>
        </register>
      </register-group>
      <value-group name="CLK_SEL_3BIT_EXT">
        <value caption="No Clock Source (Stopped)" name="NO_CLOCK_SOURCE_STOPPED" value="0x00"/>
        <value caption="Running, No Prescaling" name="RUNNING_NO_PRESCALING" value="0x01"/>
        <value caption="Running, CLK/8" name="RUNNING_CLK_8" value="0x02"/>
        <value caption="Running, CLK/64" name="RUNNING_CLK_64" value="0x03"/>
        <value caption="Running, CLK/256" name="RUNNING_CLK_256" value="0x04"/>
        <value caption="Running, CLK/1024" name="RUNNING_CLK_1024" value="0x05"/>
        <value caption="Running, ExtClk Tn Falling Edge" name="RUNNING_EXTCLK_TN_FALLING_EDGE" value="0x06"/>
        <value caption="Running, ExtClk Tn Rising Edge" name="RUNNING_EXTCLK_TN_RISING_EDGE" value="0x07"/>
      </value-group>
    </module>
    <module caption="External Interrupts" name="EXINT">
      <register-group caption="External Interrupts" name="EXINT">
        <register caption="Pin Change Mask Register 2" name="PCMSK2" offset="0x49" size="1">
          <bitfield caption="Pin Change Enable Masks" mask="0x3F" name="PCINT" lsb="12"/>
        </register>
        <register caption="Pin Change Mask Register 1" name="PCMSK1" offset="0x48" size="1">
          <bitfield caption="Pin Change Enable Masks" mask="0x0F" name="PCINT" lsb="8"/>
        </register>
