Rahix/avr-device/vendor/attiny1634.atdf
        <register caption="Pin Change Mask Register 0" name="PCMSK0" offset="0x47" size="1">
          <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT"/>
        </register>
        <register caption="General Interrupt Flag Register" name="GIFR" offset="0x5B" size="1">
          <bitfield caption="External Interrupt Flag 0" mask="0x40" name="INTF0"/>
          <bitfield caption="Pin Change Interrupt Flags" mask="0x38" name="PCIF"/>
        </register>
        <register caption="General Interrupt Mask Register" name="GIMSK" offset="0x5C" size="1">
          <bitfield caption="External Interrupt Request 0 Enable" mask="0x40" name="INT0"/>
          <bitfield caption="Pin Change Interrupt Enables" mask="0x38" name="PCIE"/>
        </register>
      </register-group>
    </module>
    <module caption="CPU Registers" name="CPU">
      <register-group caption="CPU Registers" name="CPU">
        <register caption="Power Reduction Register" name="PRR" offset="0x54" size="1">
          <bitfield caption="Power Reduction TWI" mask="0x40" name="PRTWI"/>
          <bitfield caption="Power Reduction Timer/Counter1" mask="0x20" name="PRTIM1"/>
          <bitfield caption="Power Reduction Timer/Counter0" mask="0x10" name="PRTIM0"/>
          <bitfield caption="Power Reduction USI" mask="0x08" name="PRUSI"/>
          <bitfield caption="Power Reduction USART1" mask="0x04" name="PRUSART1"/>
          <bitfield caption="Power Reduction USART0" mask="0x02" name="PRUSART0"/>
          <bitfield caption="Power Reduction ADC" mask="0x01" name="PRADC"/>
        </register>
        <register caption="Configuration Change Protection" name="CCP" offset="0x4F" size="1" mask="0xFF"/>
        <register caption="Oscillator Calibration Value" name="OSCCAL0" offset="0x63" size="1" mask="0xFF" ocd-rw="R"/>
        <register name="OSCCAL1" offset="0x66" size="1" mask="0x03" ocd-rw="R"/>
        <register name="OSCTCAL0A" offset="0x64" size="1" mask="0xFF" ocd-rw="R"/>
        <register name="OSCTCAL0B" offset="0x65" size="1" mask="0xFF" ocd-rw="R"/>
        <register caption="Clock Prescale Register" name="CLKPR" offset="0x53" size="1">
          <bitfield caption="Clock Prescaler Select Bits" mask="0x0F" name="CLKPS" values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
        </register>
        <register caption="Clock Setting Register" name="CLKSR" offset="0x52" size="1">
          <bitfield caption="Oscillator Ready" mask="0x80" name="OSCRDY"/>
          <bitfield caption="Clock Switch Trigger" mask="0x40" name="CSTR"/>
          <bitfield caption="Clock Output (active low)" mask="0x20" name="CKOUT_IO"/>
          <bitfield caption="Start-up Time" mask="0x10" name="SUT"/>
          <bitfield caption="Clock Select Bits" mask="0x0F" name="CKSEL"/>
        </register>
        <register caption="Status Register" name="SREG" offset="0x5F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
        <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0x07FF"/>
        <register caption="MCU Control Register" name="MCUCR" offset="0x56" size="1">
          <bitfield caption="Sleep Mode Select Bits" mask="0x60" name="SM" values="CPU_SLEEP_MODE"/>
          <bitfield caption="Sleep Enable" mask="0x10" name="SE"/>
          <bitfield caption="Interrupt Sense Control 0 bits" mask="0x03" name="ISC0"/>
        </register>
        <register caption="MCU Status Register" name="MCUSR" offset="0x55" size="1">
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="General Purpose I/O Register 2" name="GPIOR2" offset="0x36" size="1" mask="0xFF"/>
        <register caption="General Purpose I/O Register 1" name="GPIOR1" offset="0x35" size="1" mask="0xFF"/>
        <register caption="General Purpose I/O Register 0" name="GPIOR0" offset="0x34" size="1" mask="0xFF"/>
        <register caption="Store Program Memory Control and Status Register" name="SPMCSR" offset="0x57" size="1" ocd-rw="R">
          <bitfield caption="Read Device Signature Imprint Table" mask="0x20" name="RSIG"/>
          <bitfield caption="Clear Temporary Page Buffer" mask="0x10" name="CTPB"/>
          <bitfield caption="Read Fuse and Lock Bits" mask="0x08" name="RFLB"/>
          <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
          <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
          <bitfield caption="Store program Memory Enable" mask="0x01" name="SPMEN"/>
        </register>
      </register-group>
      <value-group name="CPU_CLK_PRESCALE_4_BITS_SMALL">
        <value caption="1" name="1" value="0x00"/>
        <value caption="2" name="2" value="0x01"/>
        <value caption="4" name="4" value="0x02"/>
        <value caption="8" name="8" value="0x03"/>
        <value caption="16" name="16" value="0x04"/>
        <value caption="32" name="32" value="0x05"/>
        <value caption="64" name="64" value="0x06"/>
        <value caption="128" name="128" value="0x07"/>
        <value caption="256" name="256" value="0x08"/>
      </value-group>
      <value-group name="CPU_SLEEP_MODE">
        <value caption="Idle" name="IDLE" value="0x00"/>
        <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
        <value caption="Power Down" name="PDOWN" value="0x02"/>
        <value caption="Standby" name="STDBY" value="0x03"/>
      </value-group>
      
    </module>
    <module caption="Universal Serial Interface" name="USI">
      <register-group caption="Universal Serial Interface" name="USI">
        <register caption="USI Buffer Register" name="USIBR" offset="0x4D" size="1" mask="0xFF" ocd-rw="R"/>
        <register caption="USI Data Register" name="USIDR" offset="0x4C" size="1" mask="0xFF"/>
        <register caption="USI Status Register" name="USISR" offset="0x4B" size="1" ocd-rw="R">
          <bitfield caption="Start Condition Interrupt Flag" mask="0x80" name="USISIF"/>
          <bitfield caption="Counter Overflow Interrupt Flag" mask="0x40" name="USIOIF"/>
          <bitfield caption="Stop Condition Flag" mask="0x20" name="USIPF"/>
          <bitfield caption="Data Output Collision" mask="0x10" name="USIDC"/>
          <bitfield caption="USI Counter Value Bits" mask="0x0F" name="USICNT"/>
        </register>
        <register caption="USI Control Register" name="USICR" offset="0x4A" size="1">
          <bitfield caption="Start Condition Interrupt Enable" mask="0x80" name="USISIE"/>
          <bitfield caption="Counter Overflow Interrupt Enable" mask="0x40" name="USIOIE"/>
          <bitfield caption="USI Wire Mode Bits" mask="0x30" name="USIWM" values="COMM_USI_OP"/>
          <bitfield caption="USI Clock Source Select Bits" mask="0x0C" name="USICS"/>
          <bitfield caption="Clock Strobe" mask="0x02" name="USICLK"/>
          <bitfield caption="Toggle Clock Port Pin" mask="0x01" name="USITC"/>
        </register>
      </register-group>
      <value-group name="COMM_USI_OP">
        <value caption="Normal Operation" name="NORMAL_OPERATION" value="0x00"/>
        <value caption="Three-Wire Mode" name="THREE_WIRE_MODE" value="0x01"/>
        <value caption="Two-Wire Mode" name="TWO_WIRE_MODE" value="0x02"/>
        <value caption="Two-Wire Mode Held Low" name="TWO_WIRE_MODE_HELD_LOW" value="0x03"/>
      </value-group>
    </module>
    <module caption="USART" name="USART">
      <register-group caption="USART" name="USART0">
        <register caption="USART I/O Data Register" name="UDR0" offset="0x40" size="1" mask="0xFF" ocd-rw=""/>
        <register caption="USART Control and Status Register A" name="UCSR0A" offset="0x46" size="1" ocd-rw="R">
          <bitfield caption="USART Receive Complete" mask="0x80" name="RXC0" rw="R"/>
          <bitfield caption="USART Transmit Complete" mask="0x40" name="TXC0"/>
          <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE0" rw="R"/>
          <bitfield caption="Framing Error" mask="0x10" name="FE0" rw="R"/>
          <bitfield caption="Data overRun" mask="0x08" name="DOR0" rw="R"/>
          <bitfield caption="Parity Error" mask="0x04" name="UPE0" rw="R"/>
          <bitfield caption="Double the USART transmission speed" mask="0x02" name="U2X0"/>
          <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM0"/>
        </register>
        <register caption="USART Control and Status Register B" name="UCSR0B" offset="0x45" size="1">
          <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE0"/>
          <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE0"/>
          <bitfield caption="USART Data register Empty Interrupt Enable" mask="0x20" name="UDRIE0"/>
          <bitfield caption="Receiver Enable" mask="0x10" name="RXEN0"/>
          <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN0"/>
          <bitfield caption="Character Size" mask="0x04" name="UCSZ02"/>
          <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB80"/>
          <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB80"/>
        </register>
        <register caption="USART Control and Status Register C" name="UCSR0C" offset="0x44" size="1">
          <bitfield caption="USART Mode Select" mask="0xC0" name="UMSEL0" values="COMM_USART_MODE_2BIT"/>
          <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM0" values="COMM_UPM_PARITY_MODE"/>
          <bitfield caption="Stop Bit Select" mask="0x08" name="USBS0" values="COMM_STOP_BIT_SEL"/>
          <bitfield caption="Character Size" mask="0x06" name="UCSZ0"/>
          <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL0"/>
        </register>
        <register caption="USART Control and Status Register D" name="UCSR0D" offset="0x43" size="1">
          <bitfield caption="USART RX Start Interrupt Enable" mask="0x80" name="RXSIE0"/>
          <bitfield caption="USART RX Start Flag" mask="0x40" name="RXS0"/>
          <bitfield caption="USART RX Start Frame Detection Enable" mask="0x20" name="SFDE0"/>
        </register>
        <register caption="USART Baud Rate Register  Bytes" name="UBRR0" offset="0x41" size="2" mask="0x0FFF"/>
      </register-group>
      <register-group caption="USART" name="USART1">
        <register caption="USART I/O Data Register" name="UDR1" offset="0x73" size="1" mask="0xFF" ocd-rw=""/>
