Rahix/avr-device/vendor/attiny1634.atdf
        <register caption="USART Control and Status Register A" name="UCSR1A" offset="0x79" size="1" ocd-rw="R">
          <bitfield caption="USART Receive Complete" mask="0x80" name="RXC1"/>
          <bitfield caption="USART Transmit Complete" mask="0x40" name="TXC1"/>
          <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE1"/>
          <bitfield caption="Framing Error" mask="0x10" name="FE1"/>
          <bitfield caption="Data overRun" mask="0x08" name="DOR1"/>
          <bitfield caption="Parity Error" mask="0x04" name="UPE1"/>
          <bitfield caption="Double the USART transmission speed" mask="0x02" name="U2X1"/>
          <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM1"/>
        </register>
        <register caption="USART Control and Status Register B" name="UCSR1B" offset="0x78" size="1">
          <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE1"/>
          <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE1"/>
          <bitfield caption="USART Data register Empty Interrupt Enable" mask="0x20" name="UDRIE1"/>
          <bitfield caption="Receiver Enable" mask="0x10" name="RXEN1"/>
          <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN1"/>
          <bitfield caption="Character Size" mask="0x04" name="UCSZ12"/>
          <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB81"/>
          <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB81"/>
        </register>
        <register caption="USART Control and Status Register C" name="UCSR1C" offset="0x77" size="1">
          <bitfield caption="USART Mode Select" mask="0xC0" name="UMSEL1" values="COMM_USART_MODE_2BIT"/>
          <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM1" values="COMM_UPM_PARITY_MODE"/>
          <bitfield caption="Stop Bit Select" mask="0x08" name="USBS1" values="COMM_STOP_BIT_SEL"/>
          <bitfield caption="Character Size" mask="0x06" name="UCSZ1"/>
          <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL1"/>
        </register>
        <register caption="USART Control and Status Register D" name="UCSR1D" offset="0x76" size="1">
          <bitfield caption="USART RX Start Interrupt Enable" mask="0x80" name="RXSIE1"/>
          <bitfield caption="USART RX Start Flag" mask="0x40" name="RXS1"/>
          <bitfield caption="USART RX Start Frame Detection Enable" mask="0x20" name="SFDE1"/>
        </register>
        <register caption="USART Baud Rate Register  Bytes" name="UBRR1" offset="0x74" size="2" mask="0x0FFF"/>
      </register-group>
      <value-group name="COMM_UPM_PARITY_MODE">
        <value caption="Disabled" name="DISABLED" value="0x00"/>
        <value caption="Reserved" name="RESERVED" value="0x01"/>
        <value caption="Enabled, Even Parity" name="ENABLED_EVEN_PARITY" value="0x02"/>
        <value caption="Enabled, Odd Parity" name="ENABLED_ODD_PARITY" value="0x03"/>
      </value-group>
      <value-group name="COMM_STOP_BIT_SEL">
        <value caption="1-bit" name="1_BIT" value="0x00"/>
        <value caption="2-bit" name="2_BIT" value="0x01"/>
      </value-group>
      <value-group name="COMM_USART_MODE_2BIT">
        <value caption="Asynchronous USART" name="ASYNCHRONOUS_USART" value="0x00"/>
        <value caption="Synchronous USART" name="SYNCHRONOUS_USART" value="0x01"/>
        <value caption="Master SPI" name="MASTER_SPI" value="0x03"/>
      </value-group>
    </module>
    <module caption="Watchdog Timer" name="WDT">
      <register-group caption="Watchdog Timer" name="WDT">
        <register caption="Watchdog Timer Control and Status Register" name="WDTCSR" offset="0x50" size="1">
          <bitfield caption="Watchdog Timer Interrupt Flag" mask="0x80" name="WDIF"/>
          <bitfield caption="Watchdog Timer Interrupt Enable" mask="0x40" name="WDIE"/>
          <bitfield caption="Watchdog Timer Prescaler Bits" mask="0x27" name="WDP" values="WDOG_TIMER_PRESCALE_4BITS_32KHZ"/>
          <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
        </register>
      </register-group>
      <value-group name="WDOG_TIMER_PRESCALE_4BITS_32KHZ">
        <value caption="Oscillator Cycles 512 (16 ms)" name="OSCILLATOR_CYCLES_512_16_MS" value="0x00"/>
        <value caption="Oscillator Cycles 1K (32 ms)" name="OSCILLATOR_CYCLES_1K_32_MS" value="0x01"/>
        <value caption="Oscillator Cycles 2K (64 ms)" name="OSCILLATOR_CYCLES_2K_64_MS" value="0x02"/>
        <value caption="Oscillator Cycles 4K (0.125 s)" name="OSCILLATOR_CYCLES_4K_0_125_S" value="0x03"/>
        <value caption="Oscillator Cycles 8K (0.25 s)" name="OSCILLATOR_CYCLES_8K_0_25_S" value="0x04"/>
        <value caption="Oscillator Cycles 16K (0.5 s)" name="OSCILLATOR_CYCLES_16K_0_5_S" value="0x05"/>
        <value caption="Oscillator Cycles 32K (1.0 s)" name="OSCILLATOR_CYCLES_32K_1_0_S" value="0x06"/>
        <value caption="Oscillator Cycles 64K (2.0 s)" name="OSCILLATOR_CYCLES_64K_2_0_S" value="0x07"/>
        <value caption="Oscillator Cycles 128K (4.0 s)" name="OSCILLATOR_CYCLES_128K_4_0_S" value="0x08"/>
        <value caption="Oscillator Cycles 256K (8.0 s)" name="OSCILLATOR_CYCLES_256K_8_0_S" value="0x09"/>
      </value-group>
    </module>
  </modules>
</avr-tools-device-file>
